telespial/telespial-EdgeAI_Smart_Pong_Demo_STMicro_STM32H7S78-DK/stm32_port/src/game/ai.c
    p->hits = (uint16_t)(((uint32_t)p->hits * 99u) / 100u);
    p->misses = (uint16_t)(((uint32_t)p->misses * 99u) / 100u);
    for (uint32_t i = 0u; i < 4u; i++)
    {
        p->style_trials[i] = (uint16_t)(((uint32_t)p->style_trials[i] * 98u) / 100u);
        p->style_value_q8[i] = (int16_t)((((int32_t)p->style_value_q8[i]) * 98) / 100);
    }
}

static uint32_t ai_profile_sample_count(const ai_learn_profile_t *p)
{
    if (!p) return 0u;
    return (uint32_t)p->hits + (uint32_t)p->misses;
}

static float ai_profile_miss_ratio(const ai_learn_profile_t *p)
{
    uint32_t n = ai_profile_sample_count(p);
    if (n == 0u) return 0.5f;
    return (float)p->misses / (float)n;
}

static bool ai_profile_is_bad(const ai_learn_profile_t *p)
{
    uint32_t n = ai_profile_sample_count(p);
    if (n < EDGEAI_LEARN_EVAL_MIN_SAMPLES) return false;
    return (ai_profile_miss_ratio(p) >= EDGEAI_LEARN_BAD_MISS_RATIO_MIN);
}

static bool ai_profile_is_good(const ai_learn_profile_t *p)
{
    uint32_t n = ai_profile_sample_count(p);
    if (n < EDGEAI_LEARN_EVAL_MIN_SAMPLES) return false;
    return (ai_profile_miss_ratio(p) <= EDGEAI_LEARN_GOOD_MISS_RATIO_MAX);
}

static uint8_t ai_style_select(pong_game_t *g, const ai_learn_profile_t *p)
{
    if (!g || !p) return 0u;

    uint32_t n_trials = (uint32_t)p->style_trials[0] + (uint32_t)p->style_trials[1] +
                        (uint32_t)p->style_trials[2] + (uint32_t)p->style_trials[3];
    float eps = (n_trials < 20u) ? 0.05f : 0.02f;

    /* Keep exploration low so early rallies stay stable. */
    if (rand_f01(g) < eps)
    {
        float r = rand_f01(g);
        uint8_t s = (uint8_t)(r * 4.0f);
        if (s > 3u) s = 3u;
        return s;
    }

    float best_score = -1000000.0f;
    uint8_t best_style = 0u;
    for (uint8_t s = 0u; s < 4u; s++)
    {
        float q = (float)p->style_value_q8[s] * (1.0f / 256.0f);
        float prior = 0.0f;
        switch (s)
        {
            case 0u: prior = p->center_bias; break;
            case 1u:
            case 2u: prior = 0.85f * p->corner_bias; break;
            default: prior = 1.00f * p->corner_bias; break;
        }
        float explore = (p->style_trials[s] == 0u) ? 0.45f : (0.12f / (float)p->style_trials[s]);
        float score = q + prior + explore;
        if (score > best_score)
        {
            best_score = score;
            best_style = s;
        }
    }

    return best_style;
}

static void ai_style_update(ai_learn_profile_t *p, uint8_t style, int32_t reward_q8)
{
    if (!p || style > 3u) return;
    if (p->style_trials[style] < 65535u) p->style_trials[style]++;

    int32_t q = (int32_t)p->style_value_q8[style];
    uint16_t n = p->style_trials[style];
    int32_t den = (n < 24u) ? (int32_t)n : 24;
    if (den < 1) den = 1;
    q += (reward_q8 - q) / den;

    if (q > 32767) q = 32767;
    if (q < -32768) q = -32768;
    p->style_value_q8[style] = (int16_t)q;
}

static void ai_style_apply(const pong_game_t *g,
                           const ai_learn_profile_t *p,
                           uint8_t style,
                           float confidence,
                           float *y_hit,
                           float *z_hit)
{
    if (!g || !p || !y_hit || !z_hit) return;

    confidence = clampf(confidence, 0.0f, 1.0f);
    float k = 0.45f + (0.55f * confidence);
    uint32_t n_hist = (uint32_t)p->hits + (uint32_t)p->misses;
    float maturity = clampf((float)n_hist * (1.0f / 24.0f), 0.0f, 1.0f);
    k *= (0.30f + 0.70f * maturity);

    float edge = 0.07f + (0.28f * p->corner_bias);
    float edge_y = edge + 0.08f * absf(g->ball.vy);
    float edge_z = edge + 0.08f * absf(g->ball.vz);

    if (style == 0u)
    {
        float hold = clampf(0.22f + 0.65f * p->center_bias, 0.00f, 0.70f) * k;
        *y_hit += (0.5f - *y_hit) * hold;
        *z_hit += (0.5f - *z_hit) * hold;
    }
    else if (style == 1u)
    {
        *y_hit += signf_nonzero(g->ball.y - 0.5f) * edge_y * k;
    }
    else if (style == 2u)
    {
        *z_hit += signf_nonzero(g->ball.z - 0.5f) * edge_z * k;
    }
    else
    {
        *y_hit += signf_nonzero(g->ball.y - 0.5f) * edge_y * k;
        *z_hit += signf_nonzero(g->ball.z - 0.5f) * edge_z * k;
    }
}

static ai_learn_profile_t *ai_profile_side(pong_game_t *g, bool right_side)
{
    if (!g) return NULL;
    return right_side ? &g->ai_profile_right : &g->ai_profile_left;
}

static const ai_learn_profile_t *ai_profile_side_const(const pong_game_t *g, bool right_side)
{
    if (!g) return NULL;
    return right_side ? &g->ai_profile_right : &g->ai_profile_left;
}

static bool ai_learning_side_selected(const pong_game_t *g, bool right_side)
{
    if (!g) return false;
    if (right_side)
    {
        if (!g->ai_right_active) return false;
        if (g->ai_learn_mode == kAiLearnModeAiAlgo) return false;
        return true;
    }

    if (!g->ai_left_active) return false;
    if (g->ai_learn_mode == kAiLearnModeAlgoAi) return false;
    return true;
}

static void ai_learning_commit_store(const pong_game_t *g)
{
    if (!g) return;
    s_learn_store.magic = EDGEAI_LEARN_STORE_MAGIC;
    s_learn_store.version = EDGEAI_LEARN_STORE_VERSION;
    s_learn_store.crc32 = 0u;
    s_learn_store.left = g->ai_profile_left;
    s_learn_store.right = g->ai_profile_right;
    s_learn_store.crc32 = ai_store_checksum(&s_learn_store);
    s_learn_store_dirty = true;
}

static void ai_learning_apply_store_to_game(pong_game_t *g, const ai_learn_store_t *store)
{
    if (!g || !store) return;
    g->ai_profile_left = store->left;
    g->ai_profile_right = store->right;
    ai_profile_clamp(&g->ai_profile_left);
    ai_profile_clamp(&g->ai_profile_right);
}

static void ai_learning_load_store(pong_game_t *g)
{
    if (!g || !g->persistent_learning) return;

    ai_learn_store_t flash_store;
    if (ai_flash_read_store(&flash_store))
    {
        s_learn_store = flash_store;
        s_learn_store_dirty = false;
        s_last_good_store = s_learn_store;
        s_last_good_valid = true;
        s_bad_sync_streak = 0u;
        ai_learning_apply_store_to_game(g, &s_learn_store);
        return;
    }

    if (s_learn_store.magic == EDGEAI_LEARN_STORE_MAGIC && s_learn_store.version == EDGEAI_LEARN_STORE_VERSION &&
        ai_store_checksum(&s_learn_store) == s_learn_store.crc32)
    {
        s_last_good_store = s_learn_store;
        s_last_good_valid = true;
        s_bad_sync_streak = 0u;
        ai_learning_apply_store_to_game(g, &s_learn_store);
    }
    else
    {
        s_learn_store.magic = EDGEAI_LEARN_STORE_MAGIC;
        s_learn_store.version = EDGEAI_LEARN_STORE_VERSION;
        s_learn_store.crc32 = 0u;
        s_learn_store.left = g->ai_profile_left;
        s_learn_store.right = g->ai_profile_right;
        s_learn_store.crc32 = ai_store_checksum(&s_learn_store);
        s_last_good_store = s_learn_store;
        s_last_good_valid = true;
        s_bad_sync_streak = 0u;
        s_learn_store_dirty = false;
    }
}

