telespial/telespial-EdgeAI_Smart_Pong_Demo_STMicro_STM32H7S78-DK/stm32_port/src/game/ai.c
void ai_learning_reset_session(pong_game_t *g)
{
    if (!g) return;
    g->ai_profile_left = ai_profile_default();
    g->ai_profile_right = ai_profile_default();
    ai_learning_load_store(g);
}

void ai_learning_set_mode(pong_game_t *g, ai_learn_mode_t mode)
{
    if (!g) return;
    switch (mode)
    {
        case kAiLearnModeBoth:
        case kAiLearnModeAiAlgo:
        case kAiLearnModeAlgoAi:
            g->ai_learn_mode = mode;
            break;
        default:
            g->ai_learn_mode = kAiLearnModeBoth;
            break;
    }
}

void ai_learning_set_persistent(pong_game_t *g, bool enabled)
{
    if (!g) return;
    if (enabled)
    {
        g->persistent_learning = true;
        ai_learning_load_store(g);
        return;
    }

    /* Persistence OFF means no carry-over advantage:
     * clear current learned profiles and wipe stored snapshot.
     */
    g->persistent_learning = false;
    ai_learning_reset_session(g);
    memset(&s_learn_store, 0, sizeof(s_learn_store));
    memset(&s_last_good_store, 0, sizeof(s_last_good_store));
    s_learn_store_dirty = false;
    s_last_good_valid = false;
    s_bad_sync_streak = 0u;
    ai_flash_clear_store();
}

void ai_learning_sync_store(pong_game_t *g)
{
    if (!g) return;
    if (!s_learn_store_dirty) return;

    /* Apply light per-match decay to avoid stale-profile lock-in across long sessions. */
    ai_profile_decay_toward_default(&g->ai_profile_left, EDGEAI_LEARN_DECAY_ALPHA);
    ai_profile_decay_toward_default(&g->ai_profile_right, EDGEAI_LEARN_DECAY_ALPHA);
    ai_profile_clamp(&g->ai_profile_left);
    ai_profile_clamp(&g->ai_profile_right);
    ai_learning_commit_store(g);

    bool left_bad = ai_profile_is_bad(&g->ai_profile_left);
    bool right_bad = ai_profile_is_bad(&g->ai_profile_right);
    bool any_bad = (left_bad || right_bad);

    if (any_bad)
    {
        if (s_bad_sync_streak < 255u) s_bad_sync_streak++;
        if (s_last_good_valid && s_bad_sync_streak >= EDGEAI_LEARN_BAD_STREAK_ROLLBACK)
        {
            ai_learning_apply_store_to_game(g, &s_last_good_store);
            ai_learning_commit_store(g);
            if (g->persistent_learning && ai_flash_write_store(&s_learn_store))
            {
                s_learn_store_dirty = false;
            }
            else if (!g->persistent_learning)
            {
                s_learn_store_dirty = false;
            }
            s_bad_sync_streak = 0u;
        }
        return;
    }

    s_bad_sync_streak = 0u;

    bool left_good = ai_profile_is_good(&g->ai_profile_left);
    bool right_good = ai_profile_is_good(&g->ai_profile_right);
    if (!(left_good || right_good)) return;

    s_last_good_store = s_learn_store;
    s_last_good_valid = true;

    if (g->persistent_learning)
    {
        if (ai_flash_write_store(&s_learn_store))
        {
            s_learn_store_dirty = false;
        }
    }
    else
    {
        s_learn_store_dirty = false;
    }
}

void ai_learning_on_paddle_hit(pong_game_t *g, bool left_side)
{
    if (!g) return;
    bool right_side = !left_side;
    if (!ai_learning_side_selected(g, right_side)) return;

    ai_learn_profile_t *p = ai_profile_side(g, right_side);
    if (!p) return;

    p->hits = clampu16((uint32_t)p->hits + 1u, 65535u);

    /* Successful return: slightly cleaner and quicker tracking, with mild anticipation. */
    p->noise_scale *= 0.987f;
    p->speed_scale += 0.008f;
    p->lead_scale += 0.005f;

    {
        uint8_t style = (p->last_style > 3u) ? 0u : p->last_style;
        float ahy = absf(g->last_hit_dy);
        float ahz = absf(g->last_hit_dz);
        int32_t reward = 18 << 8;
        if (style == 0u)
        {
            reward += ((ahy + ahz) < 0.60f) ? (6 << 8) : (-4 << 8);
            p->center_bias += 0.012f;
            p->corner_bias -= 0.003f;
        }
        else if (style == 1u)
        {
            reward += (ahy > 0.55f) ? (8 << 8) : (-3 << 8);
            p->corner_bias += 0.010f;
            p->center_bias -= 0.003f;
        }
        else if (style == 2u)
        {
            reward += (ahz > 0.55f) ? (8 << 8) : (-3 << 8);
            p->corner_bias += 0.010f;
            p->center_bias -= 0.003f;
        }
        else
        {
            reward += ((ahy + ahz) > 1.05f) ? (10 << 8) : (-4 << 8);
            p->corner_bias += 0.012f;
            p->center_bias -= 0.004f;
        }
        ai_style_update(p, style, reward);
    }

    ai_profile_clamp(p);
    ai_learning_commit_store(g);
}

void ai_learning_on_miss(pong_game_t *g, bool left_side)
{
    if (!g) return;
    bool right_side = !left_side;
    if (!ai_learning_side_selected(g, right_side)) return;

    ai_learn_profile_t *p = ai_profile_side(g, right_side);
    if (!p) return;

    p->misses = clampu16((uint32_t)p->misses + 1u, 65535u);

    /* Missed return: make AI react faster and reduce wander so it recovers over the session. */
    p->noise_scale *= 0.94f;
    p->speed_scale += 0.045f;
    p->lead_scale += 0.030f;

    {
        uint8_t style = (p->last_style > 3u) ? 0u : p->last_style;
        int32_t penalty = -22 << 8;
        ai_style_update(p, style, penalty);
        if (style == 0u)
        {
            p->center_bias -= 0.014f;
            p->corner_bias += 0.004f;
        }
        else
        {
            p->corner_bias -= 0.012f;
            p->center_bias += 0.004f;
        }
    }

    ai_profile_clamp(p);
    ai_learning_commit_store(g);
}

static void ai_sim_wall(float *p, float *v, float r)
{
    if (!p || !v) return;
    if ((*p - r) < 0.0f)
    {
        *p = r;
        *v = absf(*v);
    }
    if ((*p + r) > 1.0f)
    {
        *p = 1.0f - r;
        *v = -absf(*v);
    }
}

static void ai_predict_right(const pong_game_t *g, float dt, float *out_y, float *out_z, float *out_t)
{
    if (!out_y || !out_z || !out_t)
        return;

    *out_y = 0.5f;
    *out_z = 0.5f;
    *out_t = 0.0f;
    if (!g) return;

    if (g->ball.vx <= 0.0f)
    {
        *out_y = 0.5f;
        *out_z = 0.5f;
        *out_t = 0.0f;
        return;
    }

    float x = g->ball.x;
    float y = g->ball.y;
    float z = g->ball.z;
    float vx = g->ball.vx;
    float vy = g->ball.vy;
    float vz = g->ball.vz;
    float r = g->ball.r;

    const float x_hit = g->paddle_r.x_plane - r;
    const int max_steps = 240; /* ~4s at 60 Hz */

    for (int i = 0; i < max_steps; i++)
    {
        x += vx * dt;
        y += vy * dt;
        z += vz * dt;
        ai_sim_wall(&y, &vy, r);
        ai_sim_wall(&z, &vz, r);
        if (x >= x_hit)
        {
            *out_y = clampf(y, 0.0f, 1.0f);
            *out_z = clampf(z, 0.0f, 1.0f);
            *out_t = (float)(i + 1) * dt;
            return;
        }
    }
}

static void ai_predict_left(const pong_game_t *g, float dt, float *out_y, float *out_z, float *out_t)
{
    if (!out_y || !out_z || !out_t)
        return;

    *out_y = 0.5f;
    *out_z = 0.5f;
    *out_t = 0.0f;
    if (!g) return;

