telespial/telespial-EdgeAI_Smart_Pong_Demo_STMicro_STM32H7S78-DK/stm32_port/src/game/ai.c
    if (g->ball.vx >= 0.0f)
    {
        *out_y = 0.5f;
        *out_z = 0.5f;
        *out_t = 0.0f;
        return;
    }

    float x = g->ball.x;
    float y = g->ball.y;
    float z = g->ball.z;
    float vx = g->ball.vx;
    float vy = g->ball.vy;
    float vz = g->ball.vz;
    float r = g->ball.r;

    const float x_hit = g->paddle_l.x_plane + r;
    const int max_steps = 240; /* ~4s at 60 Hz */

    for (int i = 0; i < max_steps; i++)
    {
        x += vx * dt;
        y += vy * dt;
        z += vz * dt;
        ai_sim_wall(&y, &vy, r);
        ai_sim_wall(&z, &vz, r);
        if (x <= x_hit)
        {
            *out_y = clampf(y, 0.0f, 1.0f);
            *out_z = clampf(z, 0.0f, 1.0f);
            *out_t = (float)(i + 1) * dt;
            return;
        }
    }
}

void ai_init(pong_game_t *g)
{
    if (!g) return;
    (void)npu_hal_init(&g->npu);
    ai_learning_reset_session(g);
}

static void ai_build_features(const pong_game_t *g, float f[16])
{
    if (!g || !f) return;
    memset(f, 0, 16 * sizeof(f[0]));

    f[0] = g->ball.x;
    f[1] = g->ball.y;
    f[2] = g->ball.z;
    f[3] = g->ball.vx;
    f[4] = g->ball.vy;
    f[5] = g->ball.vz;

    f[6] = g->paddle_l.y;
    f[7] = g->paddle_l.z;
    f[8] = g->paddle_l.vy;
    f[9] = g->paddle_l.vz;

    f[10] = g->paddle_r.y;
    f[11] = g->paddle_r.z;

    int32_t sd = (int32_t)g->score.left - (int32_t)g->score.right;
    if (sd > 20) sd = 20;
    if (sd < -20) sd = -20;
    f[12] = (float)sd * (1.0f / 20.0f);

    f[13] = g->last_hit_dy;
    f[14] = g->last_hit_dz;
    f[15] = 1.0f;
}

static void ai_mirror_features_x(const float in[16], float out[16])
{
    if (!in || !out) return;

    /* Keep the NPU feature view always predicting the right paddle plane:
     * - mirror x and vx
     * - swap left/right paddle features
     * - flip score diff sign (left-right -> right-left)
     */
    memcpy(out, in, 16 * sizeof(out[0]));

    out[0] = 1.0f - in[0];   /* ball.x */
    out[3] = -in[3];         /* ball.vx */

    /* left paddle (6..9) <-> right paddle (10..11) */
    out[6] = in[10]; /* opp y */
    out[7] = in[11]; /* opp z */
    out[8] = 0.0f;
    out[9] = 0.0f;

    out[10] = in[6]; /* self y */
    out[11] = in[7]; /* self z */

    out[12] = -in[12];
}

static uint32_t ai_update_div(const pong_game_t *g, bool use_npu)
{
    uint8_t d = g ? g->difficulty : 2;
    if (d < 1) d = 1;
    if (d > 3) d = 3;

    if (!use_npu)
    {
        switch (d)
        {
            case 1: return 5u;
            case 2: return 3u;
            default: return 2u;
        }
    }

    /* In mixed SKILL modes, keep EdgeAI control cadence near ALGO cadence so the
     * selected AI side is not handicapped by slower NPU refresh.
     */
    if (g && (g->ai_learn_mode != kAiLearnModeBoth))
    {
        switch (d)
        {
            case 1: return 5u;
            case 2: return 3u;
            default: return 2u;
        }
    }

    /* NPU path: throttle updates to protect frame pacing, then adapt to observed latency. */
    uint32_t div = 4u;
    switch (d)
    {
        case 1: div = 9u; break;
        case 2: div = 7u; break;
        default: div = 5u; break;
    }

    uint32_t avg_us = g ? g->npu.avg_infer_us : 0u;
    if (avg_us > 14000u) div += 3u;
    else if (avg_us > 9000u) div += 2u;
    else if (avg_us > 5000u) div += 1u;

    if (div < 2u) div = 2u;
    if (div > 14u) div = 14u;
    return div;
}

static float ai_noise(const pong_game_t *g, bool right_side)
{
    uint8_t d = g ? g->difficulty : 2;
    if (d < 1) d = 1;
    if (d > 3) d = 3;

    float n = 0.015f;
    switch (d)
    {
        case 1: n = 0.032f; break;
        case 2: n = 0.015f; break;
        default: n = 0.007f; break;
    }

    /* Show clear behavior difference when NPU path is disabled. */
    if (g && !g->ai_enabled)
    {
        n *= 1.7f;
    }

    if (g && ai_learning_side_selected(g, right_side))
    {
        const ai_learn_profile_t *p = ai_profile_side_const(g, right_side);
        if (p)
        {
            n *= p->noise_scale;
        }
        if (g->ai_learn_mode != kAiLearnModeBoth)
        {
            n *= 0.85f;
        }
    }

    n = clampf(n, 0.002f, 0.08f);
    return n;
}

static float ai_max_speed(const pong_game_t *g, bool right_side)
{
    uint8_t d = g ? g->difficulty : 2;
    if (d < 1) d = 1;
    if (d > 3) d = 3;
    float s = 1.48f;
    switch (d)
    {
        case 1: s = 1.22f; break;
        case 2: s = 1.48f; break;
        default: s = 1.78f; break;
    }

    if (g && !g->ai_enabled)
    {
        s *= 0.82f;
    }

    if (g && ai_learning_side_selected(g, right_side))
    {
        const ai_learn_profile_t *p = ai_profile_side_const(g, right_side);
        if (p)
        {
            s *= p->speed_scale;
        }
        if (g->ai_learn_mode != kAiLearnModeBoth)
        {
            s *= 1.08f;
        }
    }

    s = clampf(s, 0.70f, 2.60f);
    return s;
}

static float ai_lead_scale(const pong_game_t *g, bool right_side)
{
    if (!g) return 1.0f;
    if (!ai_learning_side_selected(g, right_side)) return 1.0f;
    const ai_learn_profile_t *p = ai_profile_side_const(g, right_side);
    if (!p) return 1.0f;
    return clampf(p->lead_scale, 0.70f, 2.00f);
}

static void ai_update_telemetry_window(pong_game_t *g)
{
    if (!g) return;

    if (g->ai_telemetry_start_cycles == 0u)
    {
        g->ai_telemetry_start_cycles = time_hal_cycles();
        return;
    }

    uint32_t elapsed_us = time_hal_elapsed_us(g->ai_telemetry_start_cycles);
    if (elapsed_us < 1000000u) return;

    uint32_t npu_hz = 0u;
    uint32_t fb_hz = 0u;

    if (elapsed_us > 0u)
    {
        npu_hz = (uint32_t)(((uint64_t)g->ai_npu_attempts_window * 1000000ull) / (uint64_t)elapsed_us);
        fb_hz = (uint32_t)(((uint64_t)g->ai_fallback_window * 1000000ull) / (uint64_t)elapsed_us);
    }

    g->ai_npu_rate_hz = clampu16(npu_hz, 999u);
    g->ai_fallback_rate_hz = clampu16(fb_hz, 999u);
    g->ai_npu_attempts_window = 0u;
    g->ai_fallback_window = 0u;
    g->ai_telemetry_start_cycles = time_hal_cycles();
}

static void ai_step_one(pong_game_t *g, float dt, pong_paddle_t *p, bool right_side)
{
    if (!g || !p) return;

