telespial/telespial-EdgeAI_Smart_Pong_Demo_STMicro_STM32H7S78-DK/stm32_port/src/game/ai.c
    bool ball_toward = right_side ? (g->ball.vx > 0.0f) : (g->ball.vx < 0.0f);
    bool side_edgeai = ai_learning_side_selected(g, right_side);
    bool use_npu = g->ai_enabled && side_edgeai && ball_toward;

    /* Refresh AI target at a lower rate for difficulty and lower CPU. */
    uint32_t div = ai_update_div(g, use_npu);
    if (div == 0u) div = 1u;
    if ((g->frame % div) == 0u)
    {
        float y_hit = 0.5f;
        float z_hit = 0.5f;
        float t_hit = 0.0f;
        bool used_npu = false;
        float npu_confidence = 1.0f;

        if (ball_toward)
        {
            if (use_npu)
            {
                float feat[16];
                float feat2[16];
                ai_build_features(g, feat);

                const float *use_feat = feat;
                if (!right_side)
                {
                    ai_mirror_features_x(feat, feat2);
                    use_feat = feat2;
                }

                g->ai_npu_attempts_window++;
                npu_pred_t pred;
                used_npu = npu_hal_predict(&g->npu, use_feat, &pred);
                if (used_npu)
                {
                    y_hit = pred.y_hit;
                    z_hit = pred.z_hit;
                    t_hit = pred.t_hit;

                    /* In mixed SKILL modes, blend NPU with analytic prediction to
                     * keep EdgeAI competitive against fixed ALGO baseline.
                     */
                    if (g->ai_learn_mode != kAiLearnModeBoth)
                    {
                        float y_ref = 0.5f;
                        float z_ref = 0.5f;
                        float t_ref = 0.0f;
                        if (right_side)
                        {
                            ai_predict_right(g, dt, &y_ref, &z_ref, &t_ref);
                        }
                        else
                        {
                            ai_predict_left(g, dt, &y_ref, &z_ref, &t_ref);
                        }

                        /* Confidence gate: when NPU diverges from analytic physics, bias heavily
                         * toward the analytic path to preserve competitiveness.
                         */
                        float dy = absf(y_hit - y_ref);
                        float dz = absf(z_hit - z_ref);
                        float dtau = absf(t_hit - t_ref);
                        float disagreement = dy + dz + (0.60f * dtau);

                        float npu_w = 0.16f;
                        if (disagreement >= 0.22f)
                        {
                            npu_w = 0.0f;
                        }
                        else if (disagreement > 0.0f)
                        {
                            float trust = 1.0f - (disagreement / 0.22f);
                            npu_w *= clampf(trust, 0.0f, 1.0f);
                        }
                        npu_confidence = clampf(1.0f - (disagreement / 0.22f), 0.0f, 1.0f);

                        const float ref_w = 1.0f - npu_w;
                        y_hit = (ref_w * y_ref) + (npu_w * y_hit);
                        z_hit = (ref_w * z_ref) + (npu_w * z_hit);
                        t_hit = (ref_w * t_ref) + (npu_w * t_hit);
                    }
                }
            }

            if (!used_npu)
            {
                if (right_side)
                {
                    ai_predict_right(g, dt, &y_hit, &z_hit, &t_hit);
                }
                else
                {
                    ai_predict_left(g, dt, &y_hit, &z_hit, &t_hit);
                }
            }

            /* Learned anticipation: shift target along projected travel based on side profile. */
            {
                float lead = ai_lead_scale(g, right_side);
                /* Give EdgeAI a little more anticipation at high ball speed. */
                if (side_edgeai)
                {
                    float vx = g->ball.vx;
                    float vy = g->ball.vy;
                    float vz = g->ball.vz;
                    float vmag = sqrtf_approx((vx * vx) + (vy * vy) + (vz * vz));
                    float hs = clampf((vmag - 1.10f) * (1.0f / 1.30f), 0.0f, 1.0f);
                    float bonus = 0.10f + 0.12f * hs;
                    if (g->ai_learn_mode != kAiLearnModeBoth) bonus += 0.05f;
                    lead *= (1.0f + bonus * hs);
                }
                float t_use = clampf(t_hit, 0.0f, 0.80f);
                float k = (lead - 1.0f) * 0.45f;
                y_hit += g->ball.vy * t_use * k;
                z_hit += g->ball.vz * t_use * k;
            }

            if (side_edgeai)
            {
                ai_learn_profile_t *lp = ai_profile_side(g, right_side);
                if (lp)
                {
                    uint8_t style = ai_style_select(g, lp);
                    lp->last_style = style;
                    ai_style_apply(g, lp, style, used_npu ? npu_confidence : 0.80f, &y_hit, &z_hit);
                }
            }

            /* Add small noise to avoid perfect play. */
            float noise = ai_noise(g, right_side);
            y_hit += rand_f(g, -noise, noise);
            z_hit += rand_f(g, -noise, noise);
        }

        if (!used_npu)
        {
            g->ai_fallback_window++;
        }

        p->target_y = clampf(y_hit, 0.0f, 1.0f);
        p->target_z = clampf(z_hit, 0.0f, 1.0f);
    }

    /* Speed-limited movement. */
    float prev_y = p->y;
    float prev_z = p->z;

    float max_speed = ai_max_speed(g, right_side);
    float max_step = max_speed * dt;

    float dy = p->target_y - p->y;
    float dz = p->target_z - p->z;
    dy = clampf(dy, -max_step, max_step);
    dz = clampf(dz, -max_step, max_step);
    p->y += dy;
    p->z += dz;

    /* Clamp inside arena. */
    float hy = p->size_y * 0.5f;
    float hz = p->size_z * 0.5f;
    p->y = clampf(p->y, hy, 1.0f - hy);
    p->z = clampf(p->z, hz, 1.0f - hz);

    p->vy = (p->y - prev_y) / dt;
    p->vz = (p->z - prev_z) / dt;
}

void ai_step(pong_game_t *g, float dt, bool ai_left, bool ai_right)
{
    if (!g) return;

    if (ai_left)
    {
        ai_step_one(g, dt, &g->paddle_l, false);
    }
    if (ai_right)
    {
        ai_step_one(g, dt, &g->paddle_r, true);
    }

    /* Gentle decay toward baseline so long sessions stay stable. */
    if (ai_learning_side_selected(g, false))
    {
        ai_learn_profile_t *p = &g->ai_profile_left;
        p->speed_scale += (1.0f - p->speed_scale) * 0.0008f;
        p->noise_scale += (1.0f - p->noise_scale) * 0.0010f;
        p->lead_scale += (1.0f - p->lead_scale) * 0.0008f;
        ai_profile_clamp(p);
    }
    if (ai_learning_side_selected(g, true))
    {
        ai_learn_profile_t *p = &g->ai_profile_right;
        p->speed_scale += (1.0f - p->speed_scale) * 0.0008f;
        p->noise_scale += (1.0f - p->noise_scale) * 0.0010f;
        p->lead_scale += (1.0f - p->lead_scale) * 0.0008f;
        ai_profile_clamp(p);
    }

    ai_update_telemetry_window(g);
}
